Revit 2024 API
RebarHostData.GetRebarContainersInHost Method
 Returns all RebarContainer elements hosted by the referenced element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public IList<RebarContainer> GetRebarContainersInHost()
Visual Basic
Public Function GetRebarContainersInHost As IList(Of RebarContainer)
Visual C++
public:
IList<RebarContainer^>^ GetRebarContainersInHost()
See Also
RebarHostData Class
Autodesk.Revit.DB.Structure Namespace